{"_id":{"$oid":"6614259257601c2f0bbb27ef"},"Name":"Russell Crowe","Bio":"Russell Ira Crowe was born in Wellington, New Zealand, to Jocelyn Yvonne (Wemyss) and John Alexander Crowe, both of whom catered movie sets. His maternal grandfather, Stanley Wemyss, was a cinematographer. Crowe's recent ancestry includes Welsh (where his paternal grandfather was born, in Wrexham), English, Irish, Scottish, Norwegian, Swedish, Italian, and Maori (one of Crowe's maternal great-grandmothers, Erana Putiputi Hayes Heihi, was Maori).","Birthday":{"$date":{"$numberLong":"-181008000000"}}}
{"_id":{"$oid":"6614259257601c2f0bbb27f0"},"Name":"Joaquin Phoenix","Bio":"Joaquin Phoenix was born Joaquin Rafael Bottom in San Juan, Puerto Rico, to Arlyn (Dunetz) and John Bottom, and is the middle child in a brood of five. His parents, from the continental United States, were then serving as Children of God missionaries. His mother is from a Jewish family from New York, while his father, from California, is of mostly British Isles descent. As a youngster, Joaquin took his cues from older siblings River Phoenix and Rain Phoenix, changing his name to Leaf to match their earthier monikers. When the children were encouraged to develop their creative instincts, he followed their lead into acting. Younger sisters Liberty Phoenix and Summer Phoenix rounded out the talented troupe.","Birthday":{"$date":"1974-10-28T00:00:00Z"}}
{"_id":{"$oid":"661425ab57601c2f0bbb27f1"},"Name":"Connie Nielsen","Bio":"Connie Nielsen is set to begin production on Ridley Scott's \"Gladiator 2,\" where she will star alongside Paul Mescal and Denzel Washington, reprising her iconic role of 'Lucilla' from the Academy Award-winning film \"Gladiator.\" She appears in Ava Duvernay's feature, \"Origin,\" based on the book by Isabel Wilkerson, opposite Jon Bernthal and Aunjanue Ellis-Taylor. Additionally, Nielsen has roles in the following upcoming films: \"Role Play,\" alongside Kaley Cuoco, Bill Nighy, and David Oyelowo for StudioCanal; and \"Follow Me,\" directed by Siri Rodnes. Nielsen is also preparing for the production of \"Birds Eye,\" alongside Maria Bakalova and Jean Reno.","Birthday":{"$date":{"$numberLong":"-141955200000"}}}
{"_id":{"$oid":"661425ab57601c2f0bbb27f2"},"Name":"Oliver Reed","Bio":"Robert Oliver Reed was an English actor known for his well-to-do, macho image and \"hellraiser\" lifestyle. His notable films include The Trap (1966), playing Bill Sikes in the Best Picture Oscar winner Oliver! (1968), Women in Love (1969), Hannibal Brooks (1969), The Devils (1971), Revolver (1973), portraying Athos in The Three Musketeers (1973) and The Four Musketeers (1974); the lover/stepfather in Tommy (1975), The Brood (1979), Lion of the Desert (1981), Castaway (1986), The Adventures of Baron Munchausen (1988), Funny Bones (1995) and Gladiator (2000).","Birthday":{"$date":{"$numberLong":"-1006128000000"}}}
{"_id":{"$oid":"661425ab57601c2f0bbb27f3"},"Name":"Elijah Wood","Bio":"Elijah Wood is an American actor best known for portraying Frodo Baggins in Peter Jackson's blockbuster Lord of the Rings film trilogy. In addition to reprising the role in The Hobbit series, Wood also played Ryan in the FX television comedy Wilfred (2011) and voiced Beck in the Dismore a working child actor at the time. Billing himself as Larry Fishburne during this early phase, he never studied or was trained in the technique of acting.","Birthday":{"$date":{"$numberLong":"-265852800000"}}}
{"_id":{"$oid":"661425ab57601c2f0bbb27f4"},"Name":"Carrie-Anne Moss","Bio":"Carrie-Anne Moss was born and raised in Vancouver, Canada. At age 20, after studying at the American Academy of Dramatic Arts, she moved to Europe to pursue a career in modeling. While in Spain she was cast in the TV show Dark Justice which was produced in Barcelona for its first season and Los Angeles for its second. Once in LA, Carrie-Anne was cast in other series regular opportunities like Matrix (which coincidentally presaged the movie that would later make her famous), and then Aaron Spelling's Models Inc.","Birthday":{"$date":{"$numberLong":"-74649600000"}}}
{"_id":{"$oid":"6614282e57601c2f0bbb27f5"},"Name":"Ian McKellen","Bio":"Widely regarded as one of greatest stage and screen actors both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in the UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen, a civil engineer and lay preacher. He is of Scottish, Northern Irish, and English descent. During his early childhood, his parents moved with Ian and his older sister, Jean, to the mill town of Wigan. It was in this small town that young Ian rode out World War II. He soon developed a fascination with acting and the theatre, which was encouraged by his parents. They would take him to plays, those by William Shakespeare, in particular. The amateur school productions fostered Ian's growing passion for theatre.","Birthday":{"$date":{"$numberLong":"-965865600000"}}}
{"_id":{"$oid":"6614282e57601c2f0bbb27f6"},"Name":"Viggo Mortensen","Bio":"Mortensen was born in New York City, to Grace Gamble (Atkinson) and Viggo Peter Mortensen, Sr. His father was Danish, his mother was American, and his maternal grandfather was Canadian. His parents met in Norway. They wed and moved to New York, where Viggo, Jr. was born, before moving to South America, where Viggo, Sr. managed chicken farms and ranches in Venezuela and Argentina. Two more sons were born, Charles and Walter, before the marriage grew increasingly unhappy. When Viggo was seven, his parents sent him to the St. Paul's boarding school, in the Córdoba Sierras, in Argentina. Then, at age eleven, his parents divorced. His mother moved herself and the children back to her home state of New York.","Birthday":{"$date":{"$numberLong":"-353462400000"}}}
{"_id":{"$oid":"6614283557601c2f0bbb27f7"},"Name":"Orlando Bloom","Bio":"Orlando Jonathan Blanchard Copeland Bloom was born on January 13, 1977 in Canterbury, Kent, England. His mother, Sonia Constance Josephine Bloom (née Copeland), was born in Kolkata, India, to an English family then-resident there. The man he first knew as his father, Harry Bloom, was a legendary political activist who fought for civil rights in South Africa. But Harry died of a stroke when Orlando was only four years old. After that, Orlando and his older sister, Samantha Bloom, were raised by their mother and family friend, Colin Stone. When Orlando was 13, Sonia revealed to him that Colin is actually the biological father of Orlando and his sister; the two were conceived after an agreement by his parents, since Harry, who suffered a stroke in 1975, was unable to have children.","Birthday":{"$date":"1977-01-13T00:00:00Z"}}
{"_id":{"$oid":"6614283557601c2f0bbb27f8"},"Name":"Keanu Reeves","Bio":"Keanu Charles Reeves, whose first name means \"cool breeze over the mountains\" in Hawaiian, was born September 2, 1964 in Beirut, Lebanon. He is the son of Patric Reeves, a showgirl and costume designer, and Samuel Nowlin Reeves, a geologist. Keanu's father was born in Hawaii, of British, Portuguese, Native Hawaiian, and Chinese ancestry, and Keanu's mother is originally from Essex England. After his parents' marriage dissolved, Keanu moved with his mother and younger sister, Kim Reeves, to New York City, then Toronto. Stepfather #1 was Paul Aaron, a stage and film director - he and Patricia divorced within a year, after which she went on to marry (and divorce) rock promoter Robert Miller. Reeves never reconnected with his biological father. In high school, Reeves was lukewarm toward academics but took a keen interest in ice hockey (as team goalie, he earned the nickname \"The Wall\") and drama. He eventually dropped out of school to pursue an acting career.","Birthday":{"$date":{"$numberLong":"-168220800000"}}}
{"_id":{"$oid":"6614283557601c2f0bbb27f9"},"Name":"Laurence Fishburne","Bio":"Born in Augusta, Georgia on July 30, 1961, to Hattie Bell (Crawford), a teacher, and Laurence John Fishburne, Jr., a juvenile corrections officer. His mother transplanted her family to Brooklyn after his parents divorced. At the age of 10, the young boy appeared in his first play, \"In My Many Names and Days,\" at a cramped little theater space in Manhattan. He continued on but managed to avoid the trappings of a child star per se, considering himself more a working child actor at the time. Billing himself as Larry Fishburne during this early phase, he never studied or was trained in the technique of acting.","Birthday":{"$date":{"$numberLong":"-265852800000"}}}
{"_id":{"$oid":"6614285e57601c2f0bbb27fa"},"Name":"Hugo Weaving","Bio":"Hugo Wallace Weaving was born on April 4, 1960 in Nigeria, to English parents Anne (Lennard), a tour guide and teacher, and Wallace Weaving, a seismologist. Hugo has an older brother, Simon, and a younger sister, Anna, who both also live and work in Australia. During his early childhood, the Weaving family spent most of their time traveling between Nigeria, Great Britain, and Australia. This was due to the cross-country demands of his father's job in the computer industry. Later, during his teens, Hugo spent three years in England in the seventies attending Queen Elizabeth's Hospital School in Bristol.","Birthday":{"$date":{"$numberLong":"-307497600000"}}}
{"_id":{"$oid":"6614286557601c2f0bbb27fb"},"Name":"Brad Pitt","Bio":"William Bradley \"Brad\" Pitt was born on December 18, 1963 in Shawnee, Oklahoma and raised in Springfield, Missouri to Jane Etta Pitt (née Hillhouse), a school counselor & William Alvin \"Bill\" Pitt, a truck company manager. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for El Pollo Loco.","Birthday":{"$date":{"$numberLong":"-190598400000"}}}
{"_id":{"$oid":"6614286557601c2f0bbb27fc"},"Name":"Edward Norton","Bio":"American actor, filmmaker and activist Edward Harrison Norton was born on August 18, 1969, in Boston, Massachusetts, and was raised in Columbia, Maryland.","Birthday":{"$date":{"$numberLong":"-11750400000"}}}
{"_id":{"$oid":"6614287f57601c2f0bbb27fd"},"Name":"Helena Bonham Carter","Bio":"Helena Bonham Carter is an actress of great versatility, one of the UK's finest and most successful.","Birthday":{"$date":{"$numberLong":"-113702400000"}}}
{"_id":{"$oid":"6614287f57601c2f0bbb27fe"},"Name":"Meat Loaf","Bio":"Meat Loaf was born Marvin Lee Aday in Dallas, Texas, to Wilma Artie (Hukel), a teacher and gospel singer, and Orvis Wesley Aday, a police officer. He moved to Los Angeles in 1967 to play in local bands. In 1970, he moved to New York and appeared in the Broadway musicals \"Hair\", \"Rockabye Hamlet\" and \"The Rocky Horror Show,\" and Off Broadway in \"Rainbow\", \"More Than You Deserve\", \"National Lampoon Show\" and the New York Shakespeare Festival's production of \"As You Like it;\" as well as other productions at the famed New York Public Theatre. He made his film debut with a memorable role in the cult film The Rocky Horror Picture Show (1975).","Birthday":{"$date":{"$numberLong":"-702604800000"}}}
{"_id":{"$oid":"6614288757601c2f0bbb2800"},"Name":"Liam Neeson","Bio":"Meat Loaf was born Marvin Lee Aday in Dallas, Texas, to Wilma Artie (Hukel), a teacher and gospel singer, and Orvis Wesley Aday, a police officer. He moved to Los Angeles in 1967 to play in local bands. In 1970, he moved to New York and appeared in the Broadway musicals \"Hair\", \"Rockabye Hamlet\" and \"The Rocky Horror Show,\" and Off Broadway in \"Rainbow\", \"More Than You Deserve\", \"National Lampoon Show\" and the New York Shakespeare Festival's production of \"As You Like it;\" as well as other productions at the famed New York Public Theatre. He made his film debut with a memorable role in the cult film The Rocky Horror Picture Show (1975).","Birthday":{"$date":{"$numberLong":"-554428800000"}}}
{"_id":{"$oid":"6614288757601c2f0bbb2801"},"Name":"Ben Kingsley","Bio":"Kingsley Ben-Adir was born on November 20, 1986. He is an actor, known for The OA (2016), High Fidelity (2020) and Peaky Blinders (2013).","Birthday":{"$date":"1986-11-20T00:00:00Z"}}
{"_id":{"$oid":"6614289357601c2f0bbb2802"},"Name":"Ralph Fiennes","Bio":"Kingsley Ben-Adir was born on November 20, 1986. He is an actor, known for The OA (2016), High Fidelity (2020) and Peaky Blinders (2013).","Birthday":{"$date":"1986-11-20T00:00:00Z"}}
{"_id":{"$oid":"661428b457601c2f0bbb2804"},"Name":"Caroline Goodall","Bio":"Born in Britain to Australian parents, Caroline Goodall is internationally known as a leading actress who has starred in some of the biggest blockbusters of the 90's, including Schindler's List (1993), Hook (1991), Cliffhanger (1993), Disclosure (1994), White Squall (1996) and The Princess Diaries (2001).","Birthday":{"$date":{"$numberLong":"-319852800000"}}}
{"_id":{"$oid":"661428b457601c2f0bbb2805"},"Name":"John Travolta","Bio":"John Joseph Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta (née Helen Cecilia Burke) and Salvatore/Samuel J. Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta started acting appearing in a local production of \"Who'll Save the Plowboy?\". His mother, herself an actress and dancer, enrolled him in a drama school in New York, where he studied voice, dancing and acting. He decided to combine all three of these skills and become a musical comedy performer.","Birthday":{"$date":{"$numberLong":"-500774400000"}}}
{"_id":{"$oid":"661428c357601c2f0bbb2807"},"Name":"Uma Thurman","Bio":"Uma Karuna Thurman was born in Boston, Massachusetts, into a highly unorthodox and internationally-minded family. She is the daughter of Nena Thurman (née Birgitte Caroline von Schlebrügge), a fashion model and socialite who now runs a mountain retreat, and of Robert Thurman (Robert Alexander Farrar Thurman), a professor and academic who is one of the nation's foremost Buddhist scholars. Uma's mother was born in Mexico City, Mexico, to a German father and a Swedish mother (who herself was of Swedish, Danish, and German descent). Uma's father, a New Yorker, has English, Scots-Irish, Scottish, and German ancestry. Uma grew up in Amherst, Massachusetts, where her father worked at Amherst College.","Birthday":{"$date":"1970-04-29T00:00:00Z"}}
{"_id":{"$oid":"661428d457601c2f0bbb2808"},"Name":"Samuel L. Jackson","Bio":"Samuel L. Jackson is an American producer and highly prolific actor, having appeared in over 100 films, including Die Hard with a Vengeance (1995), Unbreakable (2000), Shaft (2000), Formula 51 (2001), Black Snake Moan (2006), Snakes on a Plane (2006), and the Star Wars prequel trilogy (1999-2005), as well as the Marvel Cinematic Universe.","Birthday":{"$date":{"$numberLong":"-663638400000"}}}
{"_id":{"$oid":"661428d457601c2f0bbb2809"},"Name":"Bruce Willis","Bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD.","Birthday":{"$date":{"$numberLong":"-461462400000"}}}
{"_id":{"$oid":"661428e157601c2f0bbb280a"},"Name":"Christian Bale","Bio":"Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer \"Jenny\" (James) and David Bale. His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries throughout Bale's childhood, including England, Portugal, and the United States. Bale acknowledges the constant change was one of the influences on his career choice.","Birthday":{"$date":"1974-01-30T00:00:00Z"}}
{"_id":{"$oid":"661428e157601c2f0bbb280b"},"Name":"Heath Ledger","Bio":"Heath Ledger was born on the fourth of April 1979, in Perth, Western Australia, to Sally (Ramshaw), a teacher of French, and Kim Ledger, a mining engineer who also raced cars. His ancestry was Scottish, English, Irish, and Sephardi Jewish. As the story goes, in junior high school it was compulsory to take one of two electives, either cooking or drama. As Heath could not see himself in a cooking class he tried his hand at drama. Heath was talented, however the rest of the class did not acknowledge his talent. When he was seventeen he and a friend decided to pack up, leave school, take a car and rough it to Sydney. Heath believed Sydney to be the place where dreams were made or, at least, where actors could possibly get their big break. Upon arriving in Sydney with a purported sixty-nine cents to his name, Heath tried everything to get a break.","Birthday":{"$date":"1979-04-04T00:00:00Z"}}
{"_id":{"$oid":"661428ed57601c2f0bbb280c"},"Name":"Aaron Eckhart","Bio":"Aaron Edward Eckhart is an American actor. Born in Cupertino, California, Eckhart moved to the United Kingdom at an early age, when his father relocated the family. Several years later, he began his acting career by performing in school plays, before moving to Australia for his high school senior year. He left high school without graduating, but earned a diploma through a professional education course, and graduated from Brigham Young University (BYU) in 1994 with a Bachelor of Fine Arts (BFA) degree in film. For much of the mid-1990s, he lived in New York City as a struggling, unemployed actor.","Birthday":{"$date":{"$numberLong":"-57024000000"}}}
{"_id":{"$oid":"661428ed57601c2f0bbb280d"},"Name":"Michael Caine","Bio":"Michael Caine was born as Maurice Joseph Micklewhite in London, to Ellen (née Burchell), a cook, and Maurice Micklewhite Sr., a fish-market porter. He had a younger brother, Stanley Caine, and an older maternal half-brother named David Burchell. He left school at age 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England, he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed, he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit \"The Long and the Short and the Tall\".","Birthday":{"$date":{"$numberLong":"-1161388800000"}}}
{"_id":{"$oid":"6614290757601c2f0bbb280e"},"Name":"Marlon Brando","Bio":"Marlon Brando is widely considered the greatest movie actor of all time, rivaled only by the more theatrically oriented Laurence Olivier in terms of esteem. Unlike Olivier, who preferred the stage to the screen, Brando concentrated his talents on movies after bidding the Broadway stage adieu in 1949, a decision for which he was severely criticized when his star began to dim in the 1960s and he was excoriated for squandering his talents. No actor ever exerted such a profound influence on succeeding generations of actors as did Brando.","Birthday":{"$date":{"$numberLong":"-1443657600000"}}}
{"_id":{"$oid":"6614290757601c2f0bbb280f"},"Name":"Al Pacino","Bio":"He was born April 25, 1940 in Manhattan, New York City, to Italian-American parents, Rose (nee Gerardi) and Sal Pacino. They divorced when he was young. His mother moved them into his grandparents' home in the South Bronx. Pacino found himself often repeating the plots and voices of characters he had seen in the movies. Bored and unmotivated in school, he found a haven in school plays, and his interest soon blossomed into a full-time career. Starting onstage, he went through a period of depression and poverty, sometimes having to borrow bus fare to succeed to auditions. He made it into the prestigious Actors Studio in 1966, studying under Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors.","Birthday":{"$date":{"$numberLong":"-936835200000"}}}
{"_id":{"$oid":"6614291457601c2f0bbb2810"},"Name":"James Caan","Bio":"He was born in the Bronx, to Sophie (Falkenstein) and Arthur Caan, Jewish immigrants from Germany. His father was a meat dealer and butcher. The athletically gifted Caan played football at Michigan State University while studying economics, holds a black belt in karate and for several years was even a regular on the rodeo circuit, where he was nicknamed \"The Jewish Cowboy\". However, while studying at Hofstra University, he became intrigued by acting and was interviewed and accepted at Sanford Meisner's Neighborhood Playhouse. He then won a scholarship to study under acting coach Wynn Handman and began to appear in several off-Broadway productions, including \"I Roam\" and \"Mandingo\".","Birthday":{"$date":{"$numberLong":"-939427200000"}}}
{"_id":{"$oid":"6614291457601c2f0bbb2811"},"Name":"Robert Duvall","Bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman.","Birthday":{"$date":{"$numberLong":"-1230422400000"}}}
{"_id":{"$oid":"6614292057601c2f0bbb2812"},"Name":"Tom Hanks","Bio":"Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His mother's family, originally surnamed \"Fraga\", was entirely Portuguese, while his father was of mostly English ancestry. Tom grew up in what he has called a \"fractured\" family. He moved around a great deal after his parents' divorce, living with a succession of step-families. No problems, no alcoholism - just a confused childhood. He has no acting experience in college and credits the fact that he could not get cast in a college play with actually starting his career. He went downtown, and auditioned for a community theater play, was invited by the director of that play to go to Cleveland, and there his acting career started.","Birthday":{"$date":{"$numberLong":"-425433600000"}}}
{"_id":{"$oid":"6614292057601c2f0bbb2813"},"Name":"Robin Wright","Bio":"Robin Gayle Wright was born in Dallas, Texas, to Gayle (Gaston), a national director at Mary Kay, and Freddie Wright, a pharmaceutical executive. She grew up in San Diego, California. She started her professional career as a model in 1980 at age 14, and worked both in Paris and Japan. After finishing high school she decided to become an actress. She got a role on the soap opera Santa Barbara (1984), for which she was nominated three times for a Daytime Emmy.","Birthday":{"$date":{"$numberLong":"-117849600000"}}}
{"_id":{"$oid":"6614292b57601c2f0bbb2814"},"Name":"Gary Sinise","Bio":"Gary Alan Sinise was born in Blue Island, Illinois, to Mylles S. (Alsip) and Robert L. Sinise, A.C.E., a film editor. He is of Italian (from his paternal grandfather), English, Scottish, Irish, French, German, and Swedish ancestry. His family moved to Highland Park, where he attended high school. He was something of a rebel, playing in bands but paying little attention to school.","Birthday":{"$date":{"$numberLong":"-466905600000"}}}
{"_id":{"$oid":"6614292b57601c2f0bbb2815"},"Name":"Sally Field","Bio":"Sally Margaret Field was born November 6, 1946 in Pasadena, California, to actress Margaret Field (née Morlan) and salesman Richard Dryden Field. Her parents divorced in 1950 and her mother then married stuntman Jock Mahoney, and they had a daughter, Princess O'Mahoney. She also has a brother, Richard Field. Sally attended Birmingham High School in Van Nuys, California.","Birthday":{"$date":{"$numberLong":"-730684800000"}}}
{"_id":{"$oid":"6614293657601c2f0bbb2816"},"Name":"Leonardo DiCaprio","Bio":"Few actors in the world have had a career quite as diverse as Leonardo DiCaprio's. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains (1985) and low budget horror movies, such as Critters 3 (1991), to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet (1996) and Titanic (1997), to then become a leading man in Hollywood blockbusters, made by internationally renowned directors such as Martin Scorsese and Christopher Nolan.","Birthday":{"$date":"1974-11-11T00:00:00Z"}}
{"_id":{"$oid":"6614293657601c2f0bbb2817"},"Name":"Joseph Gordon-Levitt","Bio":"Joseph Leonard Gordon-Levitt was born February 17, 1981 in Los Angeles, California, to Jane Gordon and Dennis Levitt. Joseph was raised in a Jewish family with his late older brother, Dan Gordon-Levitt, who passed away in October 2010. His parents worked for the Pacifica Radio station KPFK-FM and his maternal grandfather, Michael Gordon, had been a well-known movie director. Joseph first became well known for his starring role on NBC's award-winning comedy series 3rd Rock from the Sun (1996). During his six seasons on the show, he won two YoungStar Awards and also shared in three Screen Actors Guild Award® nominations for Outstanding Performance by a Comedy Series Ensemble.","Birthday":{"$date":"1981-02-17T00:00:00Z"}}
{"_id":{"$oid":"6614294257601c2f0bbb2818"},"Name":"Elliot Page","Bio":"Elliot Page was born in Halifax, Nova Scotia to Martha Philpotts, a teacher, and Dennis Page, a graphic designer. Page wanted to start acting at an early age and attended the Neptune Theater School. They began their career at the age of 10 on the award-winning television series Pit Pony (1999), for which they received a Gemini nomination and a Young Artist Awards nomination. Later, Page appeared in Marion Bridge (2002), which won the award for Best Canadian First Feature at the Toronto International Film Festival. They won a Gemini Award for their role of Lilith in the first season of ReGenesis (2004), a one-hour drama for TMN/Movie Central, and for the cable feature, Ghost Cat (2004), for Best Performance in a Children's or Youth Program or Series. In addition, Page appeared in the cult hit TV series Trailer Park Boys (2001).","Birthday":{"$date":"1987-02-21T00:00:00Z"}}
{"_id":{"$oid":"6614294257601c2f0bbb2819"},"Name":"Tom Hardy","Bio":"Edward Thomas Hardy was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Chips Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One.","Birthday":{"$date":"1977-09-15T00:00:00Z"}}
{"_id":{"$oid":"6614294c57601c2f0bbb281a"},"Name":"Tim Robbins","Bio":"Born in West Covina, California, but raised in New York City, Tim Robbins is the son of former The Highwaymen singer Gil Robbins and actress Mary Robbins (née Bledsoe). Robbins studied drama at UCLA, where he graduated with honors in 1981. That same year, he formed the Actors' Gang theater group, an experimental ensemble that expressed radical political observations through the European avant-garde form of theater. He started film work in television movies in 1983, but hit the big time in 1988 with his portrayal of dimwitted fastball pitcher \"Nuke\" Laloosh in Bull Durham (1988). Tall with baby-faced looks, he has the ability to play naive and obtuse (Cadillac Man (1990) and The Hudsucker Proxy (1994)) or slick and shrewd (The Player (1992) and Bob Roberts (1992)).","Birthday":{"$date":{"$numberLong":"-353808000000"}}}
{"_id":{"$oid":"6614294c57601c2f0bbb281b"},"Name":"Morgan Freeman","Bio":"With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!.","Birthday":{"$date":{"$numberLong":"-1028332800000"}}}
{"_id":{"$oid":"6614295657601c2f0bbb281c"},"Name":"Bob Gunton","Bio":"In 1945, Gunton was born Santa Monica, California. His parents were labor union executive Robert Patrick Gunton Sr. and his wife Rose Marie Banovetz. Gunton was raised in California and attended Mater Dei High School in Santa Ana, California. His college years were spent in the Paulist Seminary St Peter's College, in Baltimore, Maryland, and the University of California, Irvine.","Birthday":{"$date":{"$numberLong":"-761443200000"}}}
{"_id":{"$oid":"6614295657601c2f0bbb281d"},"Name":"William Sadler","Bio":"William Thomas Sadler was born on April 13, 1950 in Buffalo, New York, to Jane and William Sadler. He began his acting career in New York theaters, appearing in more than 75 productions over the course of 12 years. His roles included that of Sgt. Merwin J. Toomey in Neil Simon's Tony Award winning play \"Biloxi Blues\". He is best remembered for his roles in Die Hard 2 (1990), Bill & Ted's Bogus Journey (1991), The Shawshank Redemption (1994) and Tales from the Crypt: Demon Knight (1995). He is also a television star, appearing in such sitcoms as Roseanne (1988) and Murphy Brown (1988) and such movies-of-the weeks as Charlie and the Great Balloon Chase (1981). Sadler also starred as Sheriff Jim Valenti on the WB science fiction television series Roswell (1999).","Birthday":{"$date":{"$numberLong":"-622339200000"}}}
